[
  {
    "title": "From mergers to collapse: scalarisation dynamics in neutron star binaries",
    "authors": [
      "Llibert Aresté Saló",
      "Ricard Aguilera-Miret",
      "Miguel Bezares",
      "Thomas P. Sotiriou"
    ],
    "abstract": "We present the first fully non-linear evolutions of binary neutron star mergers in a moving-punctures approach in Einstein-scalar-Gauss-Bonnet gravity. We study both linear and quadratic-type couplings between the scalar and the Gauss-Bonnet invariant, and uncover new post-merger phenomena. These include an enhancement of the prompt collapse of a long-lived hyper-massive neutron star remnant and cases where the remnant develops a scalar configuration due to different scalarisation instabilities. This study initiates the exploration of beyond-General-Relativistic effects enhanced by the non-linear dynamics of the neutron star's fluid.",
    "arxiv_id": "2602.10755v1",
    "published": "2026-02-11T11:37:29Z",
    "updated": "2026-02-11T11:37:29Z",
    "categories": [
      "gr-qc"
    ]
  },
  {
    "title": "Effects of nonlinear interactions on the superradiant instability of charged black holes",
    "authors": [
      "Bo-Wen Qin",
      "Yu-Peng Zhang"
    ],
    "abstract": "A Reissner-Nordström black hole (RNBH) enclosed in a cavity is known to be superradiantly unstable to charged scalar perturbations below a critical frequency. Inspired by the emergence of the QCD axion as a prominent dark matter candidate, we construct a model featuring an axion field coupled to an electromagnetic field that undergoes superradiant growth around an RNBH. Utilizing numerical relativity, we achieve stable, long-term evolution of this system and perform a comparative analysis across various parameter spaces. Our comprehensive investigation reveals the formation of a hairy black hole, whose final state is governed by a diverse set of physical parameters. Notably, the decay constant in the axion potential, representing nonlinear interactions, bifurcates the superradiant instability into two distinct behavioral regimes, leading to more significant dynamical shifts than previously reported. Furthermore, we examine the influence of the scalar field's charge and mass, as well as the mirror's position. We investigate the axionic bosenova process and observe a long-term beating pattern of the axion field induced by nonlinear interactions. By fine-tuning these parameter combinations, we demonstrate that the system can evolve toward a variety of distinct physical endpoints.",
    "arxiv_id": "2602.05268v1",
    "published": "2026-02-05T03:47:11Z",
    "updated": "2026-02-05T03:47:11Z",
    "categories": [
      "gr-qc"
    ]
  },
  {
    "title": "Dynamical hair growth in black hole binaries in Einstein-scalar-Gauss-Bonnet gravity",
    "authors": [
      "Lodovico Capuano",
      "Llibert Aresté Saló",
      "Daniela D. Doneva",
      "Stoytcho S. Yazadjiev",
      "Enrico Barausse"
    ],
    "abstract": "Within the framework of scalar-tensor theories of gravity, certain models can evade classical black hole no-hair theorems. A well-known example is Einstein-scalar-Gauss-Bonnet gravity, where black holes carrying a scalar charge can exist. We find that, within this theory, binary black holes initially described by General Relativity can acquire scalar charges once they reach a critical orbital separation (\"dynamical scalarization\"). We develop a simple semi-analytic model, based on the adiabatic conservation of the total Wald entropy, to estimate the scalar charge evolution during the binary inspiral. We also run fully nonlinear numerical-relativity simulations for different configurations, finding consistent results. The gravitational-wave phase difference between Einstein-scalar-Gauss-Bonnet and General Relativity waveforms, which we use to assess detectability, is also computed. We find that dynamical scalarization might be observable in nearly equal-mass binary black hole mergers with third-generation ground-based gravitational-wave detectors, in a narrow range of the dimensional coupling of the theory.",
    "arxiv_id": "2602.02650v1",
    "published": "2026-02-02T19:00:01Z",
    "updated": "2026-02-02T19:00:01Z",
    "categories": [
      "gr-qc"
    ]
  },
  {
    "title": "Hyperbolicity analysis of the linearised 3+1 formulation in the Teleparallel Equivalent of General Relativity",
    "authors": [
      "Cheng Cheng",
      "Maria Jose Guzman"
    ],
    "abstract": "We study the properties of the principal symbol of the 3+1 equations of motion in Teleparallel Equivalent of General Relativity (TEGR) and assess the conditions for hyperbolicity. We use the Hamiltonian formulation based on the vectorial, antisymmetric, symmetric trace-free, and trace (VAST) decomposition of the canonical variables in the Hamiltonian formalism, and the Hamilton's equations previously presented in the literature. We study the system of differential equations at the linear level, and show that the principal symbol has a sector with imaginary eigenvalues, which renders the system not hyperbolic. This situation persists by taking spatial derivatives in either one or three coordinate directions, and it should be interpreted as a problem of the specific gauge choice instead of a general problem with TEGR. The first practical use of Hamilton's equations in this work can be extended for proving well-posedness in spherical symmetry, and establish numerical relativity setups in TEGR.",
    "arxiv_id": "2602.01830v1",
    "published": "2026-02-02T09:05:15Z",
    "updated": "2026-02-02T09:05:15Z",
    "categories": [
      "gr-qc"
    ]
  },
  {
    "title": "An autoencoder-based surrogate waveform model for quasi-circular binary-black-hole mergers",
    "authors": [
      "Anastasios Theodoropoulos",
      "Nino Villanueva",
      "Osvaldo Gramaxo Freitas",
      "Tiago Fernandes",
      "Solange Nunes",
      "Alejandro Torres-Forne",
      "Jose A. Font",
      "Antonio Onofre",
      "Jose D. Martin-Guerrero"
    ],
    "abstract": "The generation of accurate waveforms from binary black hole (BBH) mergers is a major effort in Gravitational-Wave Astronomy. In recent years, machine-learning-based surrogate models for BBH waveforms have been proposed. Those offer the potential to dramatically accelerate waveform generation while maintaining accuracy competitive with that of traditional waveform approximants. In this work, we investigate the viability of autoencoders as generative models for gravitational-wave signals from quasi-circular BBH mergers. We introduce AESur3dq8, a novel surrogate waveform model based on autoencoders that enables the rapid and accurate construction of large template banks, producing millions of waveforms in under a second using modest computational resources. The model is trained on the numerical-relativity-informed surrogate NRHybSur3dq8 and subsequently fine-tuned using the SXS catalog of BBH simulations. We demonstrate that waveforms generated by AESur3dq8 achieve mismatches of order $10^{-4}$ with respect to Numerical Relativity waveforms, and that parameter estimation performed with these templates yields results fully consistent with those reported by the LIGO-Virgo-KAGRA Collaboration for observed gravitational-wave events.",
    "arxiv_id": "2602.00203v1",
    "published": "2026-01-30T12:20:08Z",
    "updated": "2026-01-30T12:20:08Z",
    "categories": [
      "astro-ph.IM",
      "astro-ph.HE",
      "gr-qc"
    ]
  },
  {
    "title": "A Maximum Entropy Conjecture for Black Hole Mergers",
    "authors": [
      "Monica Rincon-Ramirez",
      "Nathan K. Johnson-McDaniel",
      "Eugenio Bianchi",
      "Ish Gupta",
      "Vaishak Prasad",
      "B. S. Sathyaprakash"
    ],
    "abstract": "The final state of a binary black hole merger is predicted with high precision by numerical relativity, but could there be a simple thermodynamic principle within general relativity that governs the selection of the remnant? Using post-Newtonian relations between the mass M (including the binding energy) and angular momentum J of quasi-circular, nonspinning binaries, we uncover a puzzling result: When the binary's instantaneous M and J are mapped to those of a hypothetical Kerr black hole, the corresponding entropy exhibits a maximum during the evolution. This maximum occurs at values of M and J strikingly close to those of the final remnant predicted by numerical relativity. Consistent behavior is observed when using the relation between M and J obtained from numerical relativity evolution. Although this procedure is somewhat ad hoc, the agreement between the masses and spins of the final state obtained from numerical relativity and the results of this maximum entropy procedure is remarkable, with agreement to within a few percent when using either post-Newtonian or numerical relativity results for M and J. These findings allow us to propose an entropy maximization conjecture for binary black hole mergers, hinting that thermodynamic principles may govern the selection of the final black hole state.",
    "arxiv_id": "2601.22388v1",
    "published": "2026-01-29T22:55:26Z",
    "updated": "2026-01-29T22:55:26Z",
    "categories": [
      "gr-qc",
      "astro-ph.HE",
      "hep-th"
    ]
  },
  {
    "title": "aurel: A Python package for automatic relativistic calculations",
    "authors": [
      "Robyn L. Munoz",
      "Christian T. Byrnes",
      "Will J. Roper"
    ],
    "abstract": "\\texttt{aurel} is an open-source Python package designed to \\emph{au}tomatically calculate \\emph{rel}ativistic quantities. It uses an efficient, flexible and user-friendly caching and dependency-tracking system, ideal for managing the highly nonlinear nature of general relativity. The package supports both symbolic and numerical calculations. The symbolic part extends \\texttt{SymPy} with additional tensorial calculations. The numerical part computes a wide range of tensorial quantities, such as curvature, matter kinematics and much more, directly from any spacetime and matter data arrays using finite-difference methods. Inputs can be either generated from analytical expressions or imported from Numerical Relativity (NR) simulations, with helper functions provided to read in data from standard NR codes. Given the increasing use of NR, \\texttt{aurel} offers a timely post-processing tool to support the popularisation of this field.",
    "arxiv_id": "2602.00155v1",
    "published": "2026-01-29T19:01:15Z",
    "updated": "2026-01-29T19:01:15Z",
    "categories": [
      "astro-ph.IM",
      "physics.comp-ph"
    ]
  },
  {
    "title": "Numerical simulations of black hole-neutron star mergers with equal and near-equal mass ratios",
    "authors": [
      "Ivan Markin",
      "Mattia Bulla",
      "Tim Dietrich"
    ],
    "abstract": "The detection of GW230529_181500 suggested the existence of more symmetric black hole-neutron star mergers where the black hole mass can be as low as 2.6 times that of the neutron star. Black hole-neutron star binaries with even more symmetric mass ratios are expected to leave behind massive disks capable of driving bright electromagnetic transients like kilonovae. Currently, there is only a limited number of numerical-relativity simulations of black hole-neutron star mergers in this regime, which are vital for accurate gravitational waveform models and analytical fitting formulas for the remnant properties. Insufficient accuracy of these may lead to misclassification of real events and potentially missed opportunities to locate their electromagnetic counterparts. To fill this gap in the parameter space coverage, we perform simulations of black hole-neutron star mergers with mass ratios $q \\in \\{1, 1/2, 1/3\\}$. We find the gravitational waveform models do not show good agreement with the numerical waveforms, with dephasing at the level of around 1 rad at the merger. We find that the masses of the dynamical ejecta and disk are in good agreement with the available fitting formulas. The analytical formulas for the remnant black hole are in excellent agreement for the black hole mass, but are less accurate with the predictions for its spin. Moreover, we analyze the remnant disk structure and dynamics, deriving the rotation law and identifying global trapped $g$-mode density oscillations. We distinguish three types of accretion in the postmerger and find modulation of the accretion rate by the global oscillations of the disk. Finally, we model the kilonova emission these systems would produce and find that most of them are potentially detectable by Vera C. Rubin Observatory within four days after merger, and by DECam within two days after merger if located at a distance of 200 Mpc.",
    "arxiv_id": "2601.19405v1",
    "published": "2026-01-27T09:39:57Z",
    "updated": "2026-01-27T09:39:57Z",
    "categories": [
      "astro-ph.HE",
      "gr-qc"
    ]
  },
  {
    "title": "Progenitor of the recoiling super-massive black hole RBH-1 identified using HST/JWST imaging",
    "authors": [
      "Tousif Islam",
      "Tejaswi Venumadhav",
      "Digvijay Wadekar"
    ],
    "abstract": "Using a combination of \\textit{Hubble Space Telescope} and \\textit{James Webb Space Telescope} imaging, a runaway supermassive black hole (RBH-1) was recently identified with an inferred velocity of $954^{+110}_{-126}\\,\\mathrm{km\\,s^{-1}}$, likely ejected from a compact star-forming galaxy (denoted as GX) at $z \\approx 0.96$. Assuming the runaway black hole was the outcome of the gravitational-wave-driven merger of two black holes, we use its measured runaway velocity together with gravitational-wave recoil predictions from numerical relativity and black hole perturbation theory to constrain the mass ratio and spin configuration of the progenitor SMBHs that overcame the final-parsec problem and merged $\\sim 70$~Myr ago. We find that the progenitor binary must have been precessing, with a mass ratio $m_1/m_2\\lesssim 6$, and that the more massive SMBH must have possessed a high spin (dimensionless spin magnitude $\\sim 0.75$) in order to generate a recoil of this magnitude. This has important astrophysical implications as similar SMBH mergers can be an interesting source population for the upcoming LISA mission with signal-to-noise ratios $\\gtrsim$ 1000. Furthermore, the progenitor SMBH properties imply that GX was likely formed through a major, gas-rich (``wet'') merger between two galaxies of comparable mass, with a mass ratio $\\lesssim 4$.",
    "arxiv_id": "2601.18986v1",
    "published": "2026-01-26T21:41:51Z",
    "updated": "2026-01-26T21:41:51Z",
    "categories": [
      "astro-ph.HE",
      "gr-qc"
    ]
  },
  {
    "title": "Euler-Poincaré Formulation of Barotropic Fluids Coupled with ADM Gravity",
    "authors": [
      "Allan Louie"
    ],
    "abstract": "This paper develops a geometric mechanics framework for the reduction of general relativistic hydrodynamic variational principles, from the variation of worldlines approach in 4D spacetime to 3-dimensional Eulerian descriptions. We consider a self-gravitating, barotropic fluid and obtain the Euler-Poincaré equations of the system by Lagrangian reduction. Using the decomposition of general relativity into 3 + 1 dimensions, with a direction of time defined, the gauge invariance of the action over spacetime diffeomorphisms permits a 3-dimensional description of the fluid diffeomorphism by gauge fixing. The configuration space thus mirrors the Newtonian case, and by employing the Euler-Poincaré theorem, we derive the Eulerian equations of motion, in the same form as the PDEs from Newtonian fluid dynamics. The equations of motion are then derived, where the fluid variables are measured in a separate frame of reference from the variables involving gravity. Furthermore, the general relativistic barotropic fluid exhibits a Kelvin-Noether circulation conservation, which we derive in both the inertial and moving frames of reference. Finally, potential applications to Numerical Relativity are discussed.",
    "arxiv_id": "2601.17104v1",
    "published": "2026-01-23T17:02:45Z",
    "updated": "2026-01-23T17:02:45Z",
    "categories": [
      "math-ph",
      "gr-qc"
    ]
  },
  {
    "title": "Cosmological Budget of Entropy from Merging Black Holes",
    "authors": [
      "Siyuan Chen",
      "Karan Jani",
      "Thomas W. Kephart"
    ],
    "abstract": "Black holes contain more entropy than any other component of the observable universe. Gravitational-wave observations from LIGO and Virgo have shown evidence of a previously unknown black hole mass range, which provides new information to update the entropy budget. Increases in entropy due to binary black hole mergers, as implied in the second law of thermodynamics, should also be added to the budget. In this study, we update the cosmological entropy budget for black holes in the stellar to lite-intermediate-mass range $(5-300~M_\\odot)$, originating from either supernovae or binary mergers, by utilizing a suite of population synthesis models and phenomenological fits derived from numerical relativity. We report three new insights: Firstly, the cumulative entropy from merging black holes surpasses the total entropy from cosmic microwave background photons around the onset of the Over-massive Black Hole Galaxy phase at $z\\sim 12$, suggesting that mergers played a more significant role in shaping the thermodynamic state of the early universe than relic radiation. Secondly, if primordial black holes constitute a nonzero fraction of dark matter, their early binary mergers establish an ``entropy floor\" in the Dark Ages and can dominate the cumulative merger-generated entropy history even for small abundances. Thirdly, by computing the cosmological density parameters, we highlight the thermodynamic asymmetry in black hole mergers, where the production of gravitational-wave energy is inefficient compared to the immense generation of Bekenstein-Hawking entropy.",
    "arxiv_id": "2601.13621v1",
    "published": "2026-01-20T05:43:17Z",
    "updated": "2026-01-20T05:43:17Z",
    "categories": [
      "gr-qc",
      "astro-ph.HE"
    ]
  }
]